DataProcessors/ТК_ВыгрузкаИзменений_УпрДок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ТК_ВыгрузкаИзменений_УпрДок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РезультатыВыполненияОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияОбработок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщенияОбОшибках</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПравилаДляОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПравилаДляОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяМакетаПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяМакетаПравилКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПланаОбменаИзПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаОбработкиДляОтладкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаОбработкиДляОтладкиЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПротоколаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнформацияОПравилах</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПравил</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПравилДляОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОстанавливатьПоОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилаXML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилаXMLКорреспондента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилаЗачитанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилаЗачитанныеКорреспондента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладкиЗагрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПротоколированияОбменаДанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФильтрВыборочнойРегистрацииОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаЗагружены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПланаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПравил</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравилДляОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТК_ВыгрузкаИзменений_УпрДок/Ext/ManagerModule.bsl
Процедура УстановитьУзелОбменаУСтрокДерева(Дерево, УзелОбмена)
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.ЭтоГруппа Тогда
			УстановитьУзелОбменаУСтрокДерева(Строка.Строки, УзелОбмена);
		Иначе
			Строка.СсылкаНаУзелОбмена = УзелОбмена;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПакетДанных(ПравилаОбмена, УзелОбмена, СтатусВыгрузки, Выгружено, Ошибки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	
	ЧтениеХМЛ.УстановитьСтроку(ПравилаОбмена.Получить());
	ЧтениеХМЛ.Прочитать();
	
	Обмен = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	
	ФайлПротокола = ПолучитьИмяВременногоФайла(".txt");
	Обмен.ИмяФайлаПротоколаОбмена = ФайлПротокола;
	
	Обмен.РежимОбмена = "Выгрузка";
	ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
	Обмен.ИмяФайлаОбмена = ИмяВремФайла;
	Обмен.ИмяФайлаПравилОбмена ="ЧтениеXML";	
	Обмен.ЗагрузитьПравилаОбмена(ЧтениеХМЛ,"ЧтениеXML");
	
	//УстановитьУзелОбменаУСтрокДерева(Обмен.ТаблицаПравилВыгрузки.Строки,УзелОбмена);
	
	Обмен.ЗагружатьДанныеВРежимеОбмена = Истина;
	Обмен.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
	Обмен.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 0;
	
	Если УзелОбмена.Код = "BUU" Тогда
		Обмен.УстановитьЗначениеПараметраВТаблице("Получатель", УзелОбмена);
	КонецЕсли;
	
	Обмен.ВыполнитьВыгрузку();
	
	/// читаем логи
	ЧтениеТекстаПротокола = Новый ЧтениеТекста;
	ЧтениеТекстаПротокола.Открыть(ФайлПротокола, КодировкаТекста.Системная);
	ТекстПротокола = ЧтениеТекстаПротокола.Прочитать();
	
	ВсеОк = Истина;
	Для ст = 1 По СтрЧислоСтрок(ТекстПротокола) Цикл 
		тст  = СтрПолучитьСтроку(ТекстПротокола,ст);
		Если  СтрНайти(тст,"Выгружено объектов:") > 0 Тогда
			Попытка
				Выгружено = Число(СокрЛП(СтрЗаменить(тст,"Выгружено объектов:","")));
			Исключение
			КонецПопытки;
		ИначеЕсли СтрНайти(ВРег(тст),ВРег("Ошибка"))> 0 Тогда
			ВсеОк = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Ошибки = ТекстПротокола;
	СтатусВыгрузки = ВсеОк;	
	ЧтениеТекстаПротокола.Закрыть();
	УдалитьФайлы(ФайлПротокола);
	
	///Результат выгрузки данных
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ИмяВремФайла, КодировкаТекста.UTF8);
	Результат = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ИмяВремФайла);
	
	ХранилищеДанных = Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	
	Возврат ХранилищеДанных;
	
КонецФункции

Процедура ВыгрузитьДанные() Экспорт 
	
	ИдентификаторОбработки = "ТК_ВыгрузкаИзменений_УпрДок";		
	КлючОбработки = "ВыгрузкаДокументы_В_УпрДок";
	
	СтруктураЗаписиЖурнала = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписиЖурнала.КлючОбработки = КлючОбработки;
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Начало обработки.", СтруктураЗаписиЖурнала);
	
	Попытка
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/work_buh_uu/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		WS.Пароль ="bynthghbpf";
		WS.Пользователь="ObmenSSL";

	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
		
		КодСостояния = "ОбработкаОбмена.ИнициализацияОбработки - Не удалось подключится к базе ""УпрДок""";						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния	"+КодСостояния, СтруктураЗаписиЖурнала);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание		"+ОшибкиИнициализации, СтруктураЗаписиЖурнала);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
		
		Возврат;
	КонецПопытки;
	
	//ПравилаОбмена	= ПолучитьМакет("Правило").ПолучитьТекст();
	//ХранилищеДанных	= Новый ХранилищеЗначения(ПравилаОбмена, Новый СжатиеДанных(9));	
	ХранилищеДанных	= ОбменДаннымиПереопределяемый.ПравилаКонвертацииОбъектов("ОбменСУпрДок");
	
	Если ХранилищеДанных = Неопределено Тогда
		КодСостояния = "РегистрСведений.ПравилаДляОбменаДанными - Не удалось найти ПравилаКонвертацииОбъектов для ПланыОбмена.ОбменСУпрДок";						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния	"+КодСостояния, СтруктураЗаписиЖурнала);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
		Возврат;
	КонецЕсли;
	
	УзелОбмена		= ПланыОбмена.ОбменСУпрДок.НайтиПоКоду("BUU");
	СтатусВыгрузки	= Ложь;
	Ошибки			= "";
	Выгружено		= 0;
	
	Попытка
		ДанныеОбмена = СформироватьПакетДанных(ХранилищеДанных, УзелОбмена, СтатусВыгрузки, Выгружено, Ошибки);
	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
		
		КодСостояния = "ОбработкаОбмена.ФормированиеПакетаДанных - Не удалось выгрузить данные";						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния	"+КодСостояния, СтруктураЗаписиЖурнала);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание		"+ОшибкиИнициализации, СтруктураЗаписиЖурнала);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
		
		Возврат;
	КонецПопытки;
	
	Если СтатусВыгрузки Тогда
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(Ошибки, СтруктураЗаписиЖурнала);
	Иначе
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(Ошибки, СтруктураЗаписиЖурнала);												
	КонецЕсли;
	
	Если Выгружено Тогда
		Ошибки = "";
		Попытка
			ОтветУпрДок = WS.ЗагрузитьПоПравилам(ДанныеОбмена,Ошибки);
			Если ОтветУпрДок Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, 1);
				РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Загружено объектов:  "+ОтветУпрДок, СтруктураЗаписиЖурнала);
				РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Окончание обработки.", СтруктураЗаписиЖурнала);
			Иначе
				РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(Ошибки, СтруктураЗаписиЖурнала);												
			КонецЕсли;
			РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, ОтветУпрДок);
		Исключение 
			ОшибкиИнициализации = ОписаниеОшибки();
			
			ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
			
			КодСостояния = "ОбработкаОбмена.ЗагрузкаДокументов - Не удалось загрузить данные";						
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния "+КодСостояния, СтруктураЗаписиЖурнала);
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание "+ОшибкиИнициализации, СтруктураЗаписиЖурнала);												
			РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
			
			Возврат;
		КонецПопытки;
	Иначе
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Окончание обработки.", СтруктураЗаписиЖурнала);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, СтатусВыгрузки);
	КонецЕсли;
	
	
КонецПроцедуры
